{
    "books": [
      {
        "id": 1,
        "title": "Nearly All the men in Lagos are mad",
        "author":"Damilare kuku",
        "image": "https://textbookcentre.com/media/cache/50/0c/500c489d8494fbd95853b490c03fb27e.webp",
        "description":"Nearly All the Men in Lagos are Mad is a short story collection written by Nigerian author and actress Damilare Kuku. It was first published by Masobe Books in 2021. The twelve short stories describe various women and their experiences with men and relationships. The stories in this book are set in Lagos, Nigeria.",
        "rate":"4"
      },
      {
       "id": 2,
        "title": "She would be king",
        "author":"Wayetu Moore",
        "image": "https://m.media-amazon.com/images/I/81Oc2CJT1TL._SY385_.jpg",
        "description":"She Would Be King, reimagines the dramatic story of Liberia’s early years through three unforgettable characters who share an uncommon bond. Gbessa, exiled from the West African village of Lai, is starved, bitten by a viper, and left for dead, but still she survives. June Dey, raised on a plantation in Virginia, hides his unusual strength until a confrontation with the overseer forces him to flee. Norman Aragon, the child of a white British colonizer and a Maroon slave from Jamaica, can fade from sight when the earth calls him. When the three meet in the settlement of Monrovia, their gifts help them salvage the tense relationship between the African American settlers and the indigenous tribes, as a new nation forms around them.",
        "rate":"3"
      },
      {
        "id": 3,
        "title": "The Secret Lives of Baba Segi's Wives",
        "author":"Lola Shoneyin",
        "image": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1264521277i/7194279.jpg",
        "description":"African-born poet Lola Shoneyin makes her fiction debut with The Secret Lives of Babi Segi’s Wives, a perceptive, entertaining, and eye-opening novel of polygamy in modern-day Nigeria. The struggles, rivalries, intricate family politics, and the interplay of personalities and relationships within the complex private world of a polygamous union come to life in The Secret Lives of Baba Segi’s Wives .",
        "rate":"4"
      },
      {
        "id": 4,
        "title": "The Havoc Of Choice",
        "author":"Wanjiru Koinange",
        "image": "https://encrypted-tbn3.gstatic.com/images?q=tbn:ANd9GcQrSMxY08KAqD3JgDb4vKT3xQmqcYplyAdgabCD8wMW42dOjENd",
        "description":"A story about family, politics and journeying through a fractured country in a delicate time, The Havoc of Choice explores the long reaching effects of colonisation and corruption within the context of a singular household and the disparate experiences of class and clan they encapsulate.2007, Kenya",
        "rate":"5"
      },
      {
        "id": 5,
        "title": "The girl with the Louding Voice",
        "author":"Abi Dare",
        "image": "https://textbookcentre.com/media/cache/71/16/711641ca218450e015c0fd9b4c59e05b.webp",
        "description":"The Girl with the Louding Voice is a 2020 coming of age novel and the debut novel of Nigerian writer Abi Daré. It tells the story of a teenage Nigerian girl called Adunni who becomes a maid and struggles with many things growing up, including her limited education, poverty and her inability to speak up for herself",
        "rate":"5"
      },
      {
        "id": 6,
        "title": "A Broken People's Playlist",
        "author":"Chimeka Garrick",
        "image": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1707838619i/208453832.jpg",
        "description":"A Broken People’s Playlist is a mosaic of stories about living, loving and hurting through very familiar sounds, in very familiar ways and finding healing in the most unlikely places.",
        "rate":"3"
      },
      {
        "id": 7,
        "title": "For what are butterflies without their wings",
        "author":"Troy Onyango",
        "image": "https://textbookcentre.com/media/cache/0a/5f/0a5f57cf4923494357212aa085f0fdb9.webp",
        "description":"a collection of 12 short stories that have a quickening pulse and pages crackling with sharp observations and gentle revelations about solitude, loneliness, connection, loss, love, and the infinite intricacies of daily human life.",
        "rate":"4"
      }, 
      {
        "id": 8,
        "title": "Lucky Girl",
        "author":"Irene Muchemi-Ndiritu",
        "image": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1660051208i/61913597.jpg",
        "description":"Longing for independence, a young sheltered Kenyan woman flees the expectations of her mother for a life in New York City that challenges all her beliefs about race, love, and family.",
        "rate":"2"
      },
      {
        "id": 9,
        "title": "Dance of the Jakaranda",
        "author":"Peter Kimani",
        "image": "https://textbookcentre.com/media/cache/97/41/97411f883d91940f9eaf63043bf50176.webp",
        "description":"Set in the shadow of Kenya's independence from Great Britain, Dance of the Jakaranda reimagines the special circumstances that brought black, brown and white men together to lay the railroad that heralded the birth of the nation.",
        "rate":"4"
      },
      {
        "id": 10,
        "title": "We are all birds of Uganda",
        "author":"Hafsa Zayyan",
        "image": "https://textbookcentre.com/media/cache/8b/e0/8be0ff6d67b7eaca37ac4d7e58e0dd66.webp",
        "description":"1960s UGANDA. Hasan struggles to keep his family business afloat following the sudden death of his wife. As he begins to put his shattered life back together piece by piece, a new regime seizes power, and a wave of rising prejudice threatens to sweep away everything he has built.",
        "rate":"3"
      },
      {
        "id": 11,
        "title": "Ghana Must Go",
        "author":"Taiye Selasi",
        "image": "https://textbookcentre.com/media/products/2030301004296_1.jpg",
        "description":"Ghana Must Go is at once a portrait of a modern family, and an exploration of the importance of where we come from to who we are. In a sweeping narrative that takes us from Accra to Lagos to London to New York, Ghana Must Go teaches that the truths we speak can heal the wounds we hide.",
        "rate":"3"
      },
      {
        "id": 12,
        "title": "Africa is not a Country",
        "author":"Dipo Faloyin",
        "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSeEWQqbUFf4u1JzUNY-RqBuam_cyDzHDGKGA&s",
        "description":"An exhilarating journey through the myths, misconceptions and stereotypes of modern Africa.",
        "rate":"4"
      },
      {
        "id": 13,
        "title": "Things Fall Apart",
        "author":"Chinua Achebe",
        "image": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1708114013i/37781.jpg",
        "description":"It depicts the events of pre-colonial life in Igboland, a cultural area in modern-day southeastern Nigeria, and the subsequent appearance of European missionaries and colonial forces in the late 19th century.",
        "rate":"3"
      },
      {
        "id": 14,
        "title": "Nervous Conditions",
        "author":"Tsitsi Dangarembga",
        "image": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1369859435i/158674.jpg",
        "description":"This novel captures a childhood world in 1960's rural Zimbabwe, where life depends on crops and a local river provides key necessities.",
        "rate":"5"
      },
      {
        "id": 15,
        "title": "Measuring Time",
        "author":"Helon Habila",
        "image": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1347741128i/563722.jpg",
        "description":"It follows a twin brothers, Mamo and LaMamo, raised in northeastern Nigeria amidst a blend of secularism, Christianity, and tribal tradition. Mamo, a scholar, stays in their village, while LaMamo becomes a soldier in West African wars.",
        "rate":"4"
      }
    ]
  }